
## Plan Result (prod)

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15224064542)


<pre><code>Plan: 12 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.api_gateway.aws_apigatewayv2_api.lambda_api
  * module.api_gateway.aws_apigatewayv2_integration.lambda_integration
  * module.api_gateway.aws_apigatewayv2_route.lambda_function_route
  * module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage
  * module.api_gateway.aws_cloudwatch_log_group.api_gateway
  * module.api_gateway.aws_lambda_permission.allow_apigateway
  * module.ecr.aws_ecr_repository.ecr_repository
  * module.lambda.aws_cloudwatch_log_group.lambda
  * module.lambda.aws_iam_role.lambda_role
  * module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment
  * module.lambda.aws_lambda_alias.lambda
  * module.lambda.aws_lambda_function.lambda


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_gateway.aws_apigatewayv2_api.lambda_api will be created
  + resource "aws_apigatewayv2_api" "lambda_api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "lambda-bot-prod-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = 30000
    }

  # module.api_gateway.aws_apigatewayv2_route.lambda_function_route will be created
  + resource "aws_apigatewayv2_route" "lambda_function_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /invoke"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage will be created
  + resource "aws_apigatewayv2_stage" "lambda_function_invoke_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod   = "$context.httpMethod"
                  + ip           = "$context.identity.sourceIp"
                  + protocol     = "$context.protocol"
                  + requestId    = "$context.requestId"
                  + requestTime  = "$context.requestTime"
                  + responseTime = "$context.responseLatency"
                  + routeKey     = "$context.routeKey"
                  + status       = "$context.status"
                }
            )
        }
    }

  # module.api_gateway.aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/lambda-bot-prod-api-gateway"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/lambda/lambda-bot-prod-api-gateway"
        }
      + tags_all          = {
          + "Name" = "/aws/lambda/lambda-bot-prod-api-gateway"
        }
    }

  # module.api_gateway.aws_lambda_permission.allow_apigateway will be created
  + resource "aws_lambda_permission" "allow_apigateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-bot"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "prod"
      + source_arn          = (known after apply)
      + statement_id        = "AllowInvokeFromApiGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.ecr.aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "lambda-bot-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "lambda-bot-prod"
        }
      + tags_all             = {
          + "Name" = "lambda-bot-prod"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.lambda.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/lambda-bot-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/lambda/lambda-bot-prod"
        }
      + tags_all          = {
          + "Name" = "/aws/lambda/lambda-bot-prod"
        }
    }

  # module.lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-bot-prod-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-bot-prod-role"
    }

  # module.lambda.aws_lambda_alias.lambda will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + function_name    = "lambda-bot-prod"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "prod"
    }

  # module.lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "lambda-bot-prod"
      + id                             = (known after apply)
      + image_uri                      = "public.ecr.aws/lambda/python:3.12"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "lambda-bot-prod"
        }
      + tags_all                       = {
          + "Name" = "lambda-bot-prod"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENV" = "prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_invoke_url = (known after apply)
```

</details>




## :warning: Errors

* add a label prod/add-or-update: POST https://api.github.com/repos/goda6565/lambda-bot/issues/2/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"a3d9918a70fda42734da6fef208064e891b46147","Target":"prod","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->